test/login_loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 10
      arrivalRate: 5
      rampTo: 30
      name: "Прогрев LOGIN"
    - duration: 20
      arrivalRate: 10
      name: "Тест максимальной нагрузки LOGIN"
  variables:
    email:
      - "email.akadem@gmail.com"
    password:
      - "123"
  defaults:
    headers:
      x-api-key: ""
scenarios:
  - name: "Login, chat, get list of users and logout"
    flow:
      - get:
          url: "/signin"
      - post:
          url: "/api/v1/signin"
          form:
            email: "{{ email }}"
            password: "{{ password }}"
      - loop:
          - post:
              url: "/api/v1/messages"
              form:
                message: "{{ $loopElement }}"
        over:
          - "Hi John!"
          - "Hello Peter."
          - "How are you?"
          - "Fine. And you?"
          - "Thanks. Goodbye!"
          - "Bye!"
      - get:
          url: "/api/v1/users"
      - post:
          url: "/api/v1/signout"
  - name: "Login and logout"
    flow:
      - post:
          url: "/api/v1/signin"
          form:
            email: "{{ email }}"
            password: "{{ password }}"
      - post:
          url: "/api/v1/signout"
  - name: "Login and chat"
    flow:
      - post:
          url: "/api/v1/signin"
          form:
            email: "{{ email }}"
            password: "{{ password }}"
      - loop:
          - post:
              url: "/api/v1/messages"
              form:
                message: "{{ $loopElement }}"
        over:
          - "Hi John!"
          - "Hello Peter."
          - "How are you?"
          - "Fine. And you?"
          - "Thanks. Goodbye!"
          - "Bye!"
  - name: "Login and get users"
    flow:
      - post:
          url: "/api/v1/signin"
          form:
            email: "{{ email }}"
            password: "{{ password }}"
      - get:
          url: "/api/v1/users"